src/C-C++/C++/C++11-MemoryModel-Atomic.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: C++11 Memory Model and Atomic
#+OPTIONS: num:nil H:2


* C++11 Atomic[fn:1]
C++11 Atomic可简单分为4部分:
1. =atomic= 类
2. 对 =atomic= 类型的操作函数
3. =atomic_flag= 类
4. 内存序列同步相关操作

