public_html/C-C++/C++/C++11-MemoryModel-Atomic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++11 Memory Model and Atomic</title>
<!-- 2017-06-12 Mon 19:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++11 Memory Model and Atomic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">C++11 Atomic</a>
<ul>
<li><a href="#sec-1-1"><code>atomic</code> 类</a></li>
<li><a href="#sec-1-2"><code>atomic</code> 类型的操作函数</a></li>
<li><a href="#sec-1-3"><code>atomic_flag</code> 类</a></li>
<li><a href="#sec-1-4">内存序列同步相关操作</a></li>
</ul>
</li>
<li><a href="#sec-2">Memory Model and Order</a></li>
<li><a href="#sec-3">More</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">C++11 Atomic<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">
<p>
C++11 Atomic可简单分为4部分:
</p>
<ol class="org-ol">
<li><code>atomic</code> 类
</li>
<li>对 <code>atomic</code> 类型的操作函数
</li>
<li><code>atomic_flag</code> 类
</li>
<li>内存序列同步相关操作
</li>
</ol>
</div>
