public_html/C-C++/C++/C++11-MemoryModel-Atomic.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><code>atomic</code> 类</h3>
<div class="outline-text-3" id="text-1-1">
<p>
主要分为四种模板类:
</p>
<ol class="org-ol">
<li>基本 <code>std::atomic</code>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span>&lt; <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span> &gt;
<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>;
</pre>
</div>
</li>
<li>整形(Integral)的特化
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span>&lt;&gt;
<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;Integral&gt;;
</pre>
</div>
</li>
<li>bool的特化
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span>&lt;&gt;
<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">bool</span>&gt;;
</pre>
</div>
</li>
<li>指针的特化
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span>&lt; <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">T</span> &gt;
<span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">T</span>*&gt;;
</pre>
</div>
</li>
</ol>

<p>
bool和integral类型:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #7fffd4;">std</span>::atomic_bool        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">bool</span>&gt;

<span style="color: #7fffd4;">std</span>::<span style="color: #eedd82;">atomic_char</span>        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">char</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_schar       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">signed</span> <span style="color: #98fb98;">char</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_uchar       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">char</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_short       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">short</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_ushort      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">short</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_int <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">int</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_long        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">long</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_ulong       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">long</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_llong       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">long</span> <span style="color: #98fb98;">long</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_ullong      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">long</span> <span style="color: #98fb98;">long</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_char16_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;char16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_char32_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;char32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_wchar_t     <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #98fb98;">wchar_t</span>&gt;
<span style="color: #7fffd4;">std</span>::atomic_int8_t      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint8_t     <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int16_t     <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint16_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int32_t     <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint32_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int64_t     <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint64_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_least8_t        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_least8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_least8_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_least8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_least16_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_least16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_least16_t      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_least16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_least32_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_least32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_least32_t      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_least32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_least64_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_least64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_least64_t      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_least64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_fast8_t <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_fast8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_fast8_t        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_fast8_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_fast16_t        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_fast16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_fast16_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_fast16_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_fast32_t        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_fast32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_fast32_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_fast32_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_int_fast64_t        <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::int_fast64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uint_fast64_t       <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uint_fast64_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_intptr_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::intptr_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uintptr_t   <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uintptr_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_size_t      <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::size_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_ptrdiff_t   <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::ptrdiff_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_intmax_t    <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::intmax_t&gt;
<span style="color: #7fffd4;">std</span>::atomic_uintmax_t   <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">atomic</span>&lt;<span style="color: #7fffd4;">std</span>::uintmax_t&gt;
</pre>
</div>

<p>
基本模板类定义:
</p>
<div class="org-src-container">

<pre class="src src-sh">template &lt; class T &gt; struct atomic {
    bool is_lock_free() const volatile;
    bool is_lock_free() const;
    void store(T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) volatile;
    void store(T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst);
    T load(<span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) const volatile;
    T load(<span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) const;
    operator  T() const volatile;
    operator  T() const;
    T exchange(T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) volatile;
    T exchange(T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst);
    bool compare_exchange_weak(T &amp;, T, memory_order, memory_order) volatile;
    bool compare_exchange_weak(T &amp;, T, memory_order, memory_order);
    bool compare_exchange_strong(T &amp;, T, memory_order, memory_order) volatile;
    bool compare_exchange_strong(T &amp;, T, memory_order, memory_order);
    bool compare_exchange_weak(T &amp;, T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) volatile;
    bool compare_exchange_weak(T &amp;, T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst);
    bool compare_exchange_strong(T &amp;, T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst) volatile;
    bool compare_exchange_strong(T &amp;, T, <span style="color: #eedd82;">memory_order</span> = memory_order_seq_cst);
    atomic() = default;
    constexpr atomic(T);
    atomic(const atomic &amp;) = delete;
    atomic &amp; <span style="color: #eedd82;">operator</span>=(const atomic &amp;) = delete;
    atomic &amp; <span style="color: #eedd82;">operator</span>=(const atomic &amp;) <span style="color: #eedd82;">volatile</span> = delete;
    T <span style="color: #eedd82;">operator</span>=(T) volatile;
    T <span style="color: #eedd82;">operator</span>=(T);
};
</pre>
</div>

<p>
Integral 特有的函数:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_add</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst);

<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_sub</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst);

<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_and</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_and</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst);

<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_or</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_or</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst);

<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_xor</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #87cefa;">fetch_xor</span>(<span style="color: #98fb98;">integral</span>, memory_order = memory_order_seq_cst);

<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>();
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>();
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">integral</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">integral</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">integral</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">integral</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">&amp;=</span>(<span style="color: #98fb98;">integral</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">&amp;=</span>(<span style="color: #98fb98;">integral</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">|=</span>(<span style="color: #98fb98;">integral</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">|=</span>(<span style="color: #98fb98;">integral</span>);
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">^=</span>(<span style="color: #98fb98;">integral</span>) <span style="color: #00ffff;">volatile</span>;
<span style="color: #98fb98;">integral</span> <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">^=</span>(<span style="color: #98fb98;">integral</span>);
</pre>
</div>

<p>
指针特有的函数
</p>
<div class="org-src-container">

<pre class="src src-c++">T* fetch_add(ptrdiff_t, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
T* fetch_add(ptrdiff_t, memory_order = memory_order_seq_cst);

T* fetch_sub(ptrdiff_t, memory_order = memory_order_seq_cst) <span style="color: #00ffff;">volatile</span>;
T* fetch_sub(ptrdiff_t, memory_order = memory_order_seq_cst);

  T* <span style="color: #00ffff;">operator</span>=(<span style="color: #98fb98;">T</span>*) <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">=</span>(<span style="color: #98fb98;">T</span>*);
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>(<span style="color: #98fb98;">int</span>);
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>(<span style="color: #98fb98;">int</span>);
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>() <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">++</span>();
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>() <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">--</span>();
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">+=</span>(<span style="color: #98fb98;">ptrdiff_t</span>);
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">ptrdiff_t</span>) <span style="color: #00ffff;">volatile</span>;
  <span style="color: #98fb98;">T</span>* <span style="color: #00ffff;">operator</span><span style="color: #87cefa;">-=</span>(<span style="color: #98fb98;">ptrdiff_t</span>);
</pre>
</div>
</div>
</div>
