public_html/C-C++/C++/C++11-MemoryModel-Atomic.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><code>atomic</code> 类型的操作函数</h3>
<div class="outline-text-3" id="text-1-2">
<p>
除了 <code>atomic</code> 类的成员函数,也提供了对其操作的函数:
</p>

<ul class="org-ul">
<li><code>atomic_is_lock_free</code>: checks if the atomic type's operations are
lock-free
</li>
<li><code>atomic_store</code> and <code>atomic_store_explicit</code>: atomically replaces the
value of the atomic object with a non-atomic argument
</li>
<li><code>atomic_load</code> and <code>atomic_load_explicit</code>: atomically obtains the
value stored in an atomic object
</li>
<li><code>atomic_exchange</code> and <code>atomic_exchange_explicit</code>: atomically
replaces the value of the atomic object with non-atomic argument and
returns the old value of the atomic
</li>
<li><code>atomic_compare_exchange_weak</code>
<code>atomic_compare_exchange_weak_explicit</code>
<code>atomic_compare_exchange_strong</code>
<code>atomic_compare_exchange_strong_explicit</code>: atomically compares the
value of the atomic object with non-atomic argument and performs
atomic exchange if equal or atomic load if not
</li>
<li><code>atomic_fetch_add</code>
<code>atomic_fetch_add_explicit</code>: adds a non-atomic value to an atomic
object and obtains the previous value of the atomic 
</li>
<li><code>atomic_fetch_sub</code>
<code>atomic_fetch_sub_explicit</code>: subtracts a non-atomic value from an
atomic object and obtains the previous value of the atomic 
</li>
<li><code>atomic_fetch_and</code>
<code>atomic_fetch_and_explicit</code>: replaces the atomic object with the
result of logical AND with a non-atomic argument and obtains the
previous value of the atomic 
</li>
<li><code>atomic_fetch_or</code>
<code>atomic_fetch_or_explicit</code>: replaces the atomic object with the
result of logical OR with a non-atomic argument and obtains the
previous value of the atomic 
</li>
<li><code>atomic_fetch_xor</code>
<code>atomic_fetch_xor_explicit</code>: replaces the atomic object with the
result of logical XOR with a non-atomic argument and obtains the
previous value of the atomic 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><code>atomic_flag</code> 类</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>atomic_flag</code> 是一种原子布尔类型，不同于 <code>std::atomic&lt;bool&gt;</code>, 不提供load
或store操作,只支持两种操作， <code>test_and_set</code> 和 <code>clear</code> 。
</p>

<div class="org-src-container">

<pre class="src src-c++">atomic_flag() noexcept = <span style="color: #00ffff;">default</span>;
atomic_flag (<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">atomic_flag</span>&amp;<span style="color: #eedd82;">T</span>) = <span style="color: #00ffff;">delete</span>;
</pre>
</div>

<p>
<code>std::atomic_flag</code> 只有默认构造函数，拷贝构造函数已被禁用. 一般使用
<code>ATOMIC_FLAG_INIT</code> 初始化为clear状态.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">内存序列同步相关操作</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><code>memory_order</code>: defines memory ordering constraints for the given
atomic operation 
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">memory_order</span> {
    <span style="color: #eedd82;">memory_order_relaxed</span>,
    <span style="color: #eedd82;">memory_order_consume</span>,
    <span style="color: #eedd82;">memory_order_acquire</span>,
    <span style="color: #eedd82;">memory_order_release</span>,
    <span style="color: #eedd82;">memory_order_acq_rel</span>,
    <span style="color: #eedd82;">memory_order_seq_cst</span>
};
</pre>
</div>
</li>
<li><code>kill_dependency</code>: removes the specified object from the
<code>std::memory_order_consume</code> dependency tree
</li>
<li><code>atomic_thread_fence</code>: Establishes memory synchronization ordering
of non-atomic and relaxed atomic accesses, as instructed by order,
without an associated atomic operation.
</li>
<li><code>atomic_signal_fence</code>: Establishes memory synchronization ordering
of non-atomic and relaxed atomic accesses, as instructed by order,
between a thread and a signal handler executed on the same thread.
This is equivalent to std::atomic<sub>thread</sub><sub>fence</sub>, except no CPU
instructions for memory ordering are issued. Only reordering of the
instructions by the compiler is suppressed as order instructs. 
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Memory Model and Order</h2>
<div class="outline-text-2" id="text-2">
<p>
在<a href="http://dreamrunner.org/blog/2014/06/28/qian-tan-memory-reordering/">浅谈Memory Reordering</a>中提及编译开发者和处理器制造商遵循的中心内存排序准则是: 不能改变单线程程序的行为. 从而产生了:
</p>
<ul class="org-ul">
<li>Memory ordering at compile time: 编译优化造成
</li>
<li>Memory ordering at processor time: CPU允许乱序机器指令优化造成
</li>
</ul>

<p>
在多核多线程时代，当多线程共享某一变量时，不同线程对共享变量的读写就应该格外小心，不适当的乱序执行可能导致程序运行错误。所以必须对编译器和
CPU 作出一定的约束才能合理正确地优化你的程序，这个约束就是 <b>内存模型
(Memory Model)</b> .
</p>

<p>
或者说,程序转化成机器指令执行时并不按照之前的原始代码顺序执行,所以内存模型是程序员、编译器，CPU 之间的准则约束,遵守这一准则约束后,大家各自做优化, 从而尽可能提高程序的性能。
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Memory_model_(programming)">wiki上的Memory model</a>给出一个比较抽象的描述: In computing, a memory
model describes the interactions of threads through memory and their
shared use of the data.
</p>

<p>
C++11 中规定了 6 种访存次序(Memory Order)，如下：
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">enum</span> <span style="color: #98fb98;">memory_order</span> {
    <span style="color: #eedd82;">memory_order_relaxed</span>,
    <span style="color: #eedd82;">memory_order_consume</span>,
    <span style="color: #eedd82;">memory_order_acquire</span>,
    <span style="color: #eedd82;">memory_order_release</span>,
    <span style="color: #eedd82;">memory_order_acq_rel</span>,
    <span style="color: #eedd82;">memory_order_seq_cst</span>
};
</pre>
</div>

<p>
上面C++11 Atomic涉及 <code>memory_order</code> 的接口, 默认值是
<code>std::memory_order_seq_cst</code> .
</p>

<p>
可以把上述6种访存次序(内存序)分为3类，顺序一致性模型
(<code>memory_order_seq_cst</code>)，Acquire-Release 模型
(<code>memory_order_consume</code>, <code>memory_order_acquire</code>,
<code>memory_order_release</code>, <code>memory_order_acq_rel</code>) 和 Relax 模型
(<code>memory_order_relaxed</code>). 
</p>

<ul class="org-ul">
<li><code>memory_order_relaxed</code>: all reorderings are okay<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>
<li><code>memory_order_acquire</code>: guarantees that subsequent loads are not
moved before the current load or any preceding loads.
</li>
<li><code>memory_order_release</code>: preceding stores are not moved past the
current store or any subsequent stores.
</li>
<li><code>memory_order_acq_rel</code>: combines the two previous guarantees.
</li>
<li><code>memory_order_consume</code>: potentially weaker form of
memory<sub>order</sub><sub>acquire</sub> that enforces ordering of the current load
before other operations that are data-dependent on it (for instance,
when a load of a pointer is marked memory<sub>order</sub><sub>consume</sub>, subsequent
operations that dereference this pointer won’t be moved before it
(yes, even that is not guaranteed on all platforms!).
</li>
<li><code>memory_order_scq_cst</code>: 是 <code>memory_order_acq_rel</code> 的加强版，除了有
<code>acq_rel</code> 语义，还保证是<a href="https://en.wikipedia.org/wiki/Sequential_consistency">sequencially-consistent</a>.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">More</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://github.com/forhappy/Cplusplus-Concurrency-In-Practice/blob/master/zh/chapter8-Memory-Model/web-resources.md">C++ 多线程与内存模型资料汇总</a>
</li>
<li>Herb Sutter的talk
<ul class="org-ul">
<li><a href="https://channel9.msdn.com/Shows/Going+Deep/Cpp-and-Beyond-2012-Herb-Sutter-atomic-Weapons-1-of-2">Atomic Weapons 1</a>
</li>
<li><a href="https://channel9.msdn.com/Shows/Going+Deep/Cpp-and-Beyond-2012-Herb-Sutter-atomic-Weapons-1-of-2">Atomic Weapon 2</a>
</li>
</ul>
</li>
<li><a href="https://bartoszmilewski.com/2008/12/01/c-atomics-and-memory-ordering/">C++ atomics and memory ordering</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://en.cppreference.com/w/cpp/atomic">http://en.cppreference.com/w/cpp/atomic</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="https://bartoszmilewski.com/2008/12/01/c-atomics-and-memory-ordering/">https://bartoszmilewski.com/2008/12/01/c-atomics-and-memory-ordering/</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-06-12 Mon 19:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
